---
kind: other
id: Methods.T:Autodesk.Revit.DB.DisplacementPath
source: html/b5d2c2c7-327a-f473-2fb8-2f0fffeed546.htm
---
# DisplacementPath Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.